In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.read_csv(r"D:\Data Science & AI\Pandas\assets\Data_File.csv")
data

    Variable_A  Variable_B  Variable_C  Variable_D Variable_E
0          6.0         148          72          35          A
1          1.0          85          66          29          A
2          8.0         183          64           0          B
3          1.0          89          66          23          B
4          0.0         137          40          35          C
5          5.0         116          74           0          A
6          3.0          78          50          32          C
7         10.0         115           0           0        NaN
8          2.0         197          70          45          C
9          8.0         125          96           0          C
10         NaN         110          92           0          B
11        10.0         168          74           0          A
12        10.0         139          80           0          A
13         1.0         189          60          23          C

In [4]:
data.shape

(14, 5)

In [5]:
type(data)

pandas.core.frame.DataFrame

In [6]:
type(data.shape)

tuple

In [8]:
print("The No of Rows are :",data.shape[0])
print("The No of Columns are:",data.shape[1])

The No of Rows are : 14
The No of Columns are: 5

In [9]:
# head()-It displays first five rows by default
data.head()

   Variable_A  Variable_B  Variable_C  Variable_D Variable_E
0         6.0         148          72          35          A
1         1.0          85          66          29          A
2         8.0         183          64           0          B
3         1.0          89          66          23          B
4         0.0         137          40          35          C

In [10]:
# tail()- It displays last five rows by default
data.tail()

    Variable_A  Variable_B  Variable_C  Variable_D Variable_E
9          8.0         125          96           0          C
10         NaN         110          92           0          B
11        10.0         168          74           0          A
12        10.0         139          80           0          A
13         1.0         189          60          23          C

In [11]:
data.tail(3)

    Variable_A  Variable_B  Variable_C  Variable_D Variable_E
11        10.0         168          74           0          A
12        10.0         139          80           0          A
13         1.0         189          60          23          C

In [12]:
# sample()-It displays the one random rows by default 
data.sample()

   Variable_A  Variable_B  Variable_C  Variable_D Variable_E
2         8.0         183          64           0          B

In [13]:
data.sample(3)

    Variable_A  Variable_B  Variable_C  Variable_D Variable_E
1          1.0          85          66          29          A
7         10.0         115           0           0        NaN
10         NaN         110          92           0          B

In [14]:
# describe-It displays the statistical summary of the data frame 
data.describe()

       Variable_A  Variable_B  Variable_C  Variable_D
count   13.000000   14.000000   14.000000   14.000000
mean     5.000000  134.214286   64.571429   15.857143
std      3.872983   38.912483   23.617836   17.270950
min      0.000000   78.000000    0.000000    0.000000
25%      1.000000  111.250000   61.000000    0.000000
50%      5.000000  131.000000   68.000000   11.500000
75%      8.000000  163.000000   74.000000   31.250000
max     10.000000  197.000000   96.000000   45.000000

In [15]:
# dtypes-It gives the data type
data.dtypes

Variable_A    float64
Variable_B      int64
Variable_C      int64
Variable_D      int64
Variable_E     object
dtype: object

In [16]:
# info- information of the data frame 
data.info

<bound method DataFrame.info of     Variable_A  Variable_B  Variable_C  Variable_D Variable_E
0          6.0         148          72          35          A
1          1.0          85          66          29          A
2          8.0         183          64           0          B
3          1.0          89          66          23          B
4          0.0         137          40          35          C
5          5.0         116          74           0          A
6          3.0          78          50          32          C
7         10.0         115           0           0        NaN
8          2.0         197          70          45          C
9          8.0         125          96           0          C
10         NaN         110          92           0          B
11        10.0         168          74           0          A
12        10.0         139          80           0          A
13         1.0         189          60          23          C>

In [17]:
data

    Variable_A  Variable_B  Variable_C  Variable_D Variable_E
0          6.0         148          72          35          A
1          1.0          85          66          29          A
2          8.0         183          64           0          B
3          1.0          89          66          23          B
4          0.0         137          40          35          C
5          5.0         116          74           0          A
6          3.0          78          50          32          C
7         10.0         115           0           0        NaN
8          2.0         197          70          45          C
9          8.0         125          96           0          C
10         NaN         110          92           0          B
11        10.0         168          74           0          A
12        10.0         139          80           0          A
13         1.0         189          60          23          C

In [18]:
# NaN- Not a Number
# Isna()/isnull()-To see the missing values.It returns in boolean 
data.isna()

    Variable_A  Variable_B  Variable_C  Variable_D  Variable_E
0        False       False       False       False       False
1        False       False       False       False       False
2        False       False       False       False       False
3        False       False       False       False       False
4        False       False       False       False       False
5        False       False       False       False       False
6        False       False       False       False       False
7        False       False       False       False        True
8        False       False       False       False       False
9        False       False       False       False       False
10        True       False       False       False       False
11       False       False       False       False       False
12       False       False       False       False       False
13       False       False       False       False       False

In [19]:
data.isnull()

    Variable_A  Variable_B  Variable_C  Variable_D  Variable_E
0        False       False       False       False       False
1        False       False       False       False       False
2        False       False       False       False       False
3        False       False       False       False       False
4        False       False       False       False       False
5        False       False       False       False       False
6        False       False       False       False       False
7        False       False       False       False        True
8        False       False       False       False       False
9        False       False       False       False       False
10        True       False       False       False       False
11       False       False       False       False       False
12       False       False       False       False       False
13       False       False       False       False       False

In [20]:
# isna().sum()-It will display the count of missing values number for each column 
data.isna().sum()

Variable_A    1
Variable_B    0
Variable_C    0
Variable_D    0
Variable_E    1
dtype: int64

In [21]:
data["Variable_A"].isna()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11    False
12    False
13    False
Name: Variable_A, dtype: bool

In [22]:
# dropping the missing values 
# dropna() 
# axis=0 -row wise 
# axis=1 - column wise 
data.dropna(axis=0)

    Variable_A  Variable_B  Variable_C  Variable_D Variable_E
0          6.0         148          72          35          A
1          1.0          85          66          29          A
2          8.0         183          64           0          B
3          1.0          89          66          23          B
4          0.0         137          40          35          C
5          5.0         116          74           0          A
6          3.0          78          50          32          C
8          2.0         197          70          45          C
9          8.0         125          96           0          C
11        10.0         168          74           0          A
12        10.0         139          80           0          A
13         1.0         189          60          23          C

In [23]:
data.dropna(axis=1)

    Variable_B  Variable_C  Variable_D
0          148          72          35
1           85          66          29
2          183          64           0
3           89          66          23
4          137          40          35
5          116          74           0
6           78          50          32
7          115           0           0
8          197          70          45
9          125          96           0
10         110          92           0
11         168          74           0
12         139          80           0
13         189          60          23

In [24]:
# missing values imputation 
# fillna()-To fill the missing values 
data.fillna(34)

    Variable_A  Variable_B  Variable_C  Variable_D Variable_E
0          6.0         148          72          35          A
1          1.0          85          66          29          A
2          8.0         183          64           0          B
3          1.0          89          66          23          B
4          0.0         137          40          35          C
5          5.0         116          74           0          A
6          3.0          78          50          32          C
7         10.0         115           0           0         34
8          2.0         197          70          45          C
9          8.0         125          96           0          C
10        34.0         110          92           0          B
11        10.0         168          74           0          A
12        10.0         139          80           0          A
13         1.0         189          60          23          C

In [10]:
data['Variable_A']=data['Variable_A'].fillna(10)

In [12]:
data["Variable_E"]=data["Variable_E"].fillna('a')
data.isna().sum()

Variable_A    0
Variable_B    0
Variable_C    0
Variable_D    0
Variable_E    0
dtype: int64

In [13]:
# rename-To rename the columns 
data.rename(columns={"Variable_A":"VarA", "Variable_E":"VarE"}).head(2)

   VarA  Variable_B  Variable_C  Variable_D VarE
0   6.0         148          72          35    A
1   1.0          85          66          29    A

In [14]:
# columns-It displays all columns 
data.columns

Index(['Variable_A', 'Variable_B', 'Variable_C', 'Variable_D', 'Variable_E'], dtype='object')

In [15]:
# nunique- No of unique categories 
data["Variable_E"].nunique()

3

In [16]:
# unique() 
data["Variable_E"].unique()

array(['A', 'B', 'C'], dtype=object)

In [18]:
# value_counts(
data["Variable_E"].value_counts()

Variable_E
A    6
C    5
B    3
Name: count, dtype: int64

In [10]:
data["Variable_E"].value_counts(normalize=True)

Variable_E
City A    0.384615
City C    0.384615
City B    0.230769
Name: proportion, dtype: float64

In [20]:
# replace
data["Variable_E"].replace({"A":"City A", "B":"City B", "C":"City C"})

0     City A
1     City A
2     City B
3     City B
4     City C
5     City A
6     City C
7     City A
8     City C
9     City C
10    City B
11    City A
12    City A
13    City C
Name: Variable_E, dtype: object

In [21]:
data["Variable_A"]

0      6.0
1      1.0
2      8.0
3      1.0
4      0.0
5      5.0
6      3.0
7     10.0
8      2.0
9      8.0
10    10.0
11    10.0
12    10.0
13     1.0
Name: Variable_A, dtype: float64

In [25]:
# np.where()
np.where(data["Variable_A"]>5,"True","False")

array(['True', 'False', 'True', 'False', 'False', 'False', 'False',
       'True', 'False', 'True', 'True', 'True', 'True', 'False'],
      dtype='<U5')

In [9]:
# map
data["Variable_E"].map({"A":"City_A","B":"City_B","C":"City_C"})

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
8     NaN
9     NaN
10    NaN
11    NaN
12    NaN
13    NaN
Name: Variable_E, dtype: object

In [11]:
# columns drop 
# drop-To drop any column 
data.drop("Variable_D", axis=1)

    Variable_A  Variable_B  Variable_C Variable_E
0          6.0         148          72     City A
1          1.0          85          66     City A
2          8.0         183          64     City B
3          1.0          89          66     City B
4          0.0         137          40     City C
5          5.0         116          74     City A
6          3.0          78          50     City C
7         10.0         115           0        NaN
8          2.0         197          70     City C
9          8.0         125          96     City C
10         NaN         110          92     City B
11        10.0         168          74     City A
12        10.0         139          80     City A
13         1.0         189          60     City C

In [13]:
# New columns add
data["Variable_Z"]=45000

In [14]:
data

    Variable_A  Variable_B  Variable_C  Variable_D Variable_E  Variable_Z
0          6.0         148          72          35     City A       45000
1          1.0          85          66          29     City A       45000
2          8.0         183          64           0     City B       45000
3          1.0          89          66          23     City B       45000
4          0.0         137          40          35     City C       45000
5          5.0         116          74           0     City A       45000
6          3.0          78          50          32     City C       45000
7         10.0         115           0           0        NaN       45000
8          2.0         197          70          45     City C       45000
9          8.0         125          96           0     City C       45000
10         NaN         110          92           0     City B       45000
11        10.0         168          74           0     City A       45000
12        10.0         139          80           0     City A       45000
13         1.0         189          60          23     City C       45000

In [15]:
# mathematical functions
data["Variable_A"].sum()

65.0

In [16]:
data["Variable_A"].mean()

5.0

In [17]:
data["Variable_A"].min()

0.0

In [18]:
data["Variable_A"].max()

10.0

In [19]:
data["Variable_A"].std()

3.872983346207417

In [20]:
# argmin()-It will return the lowest index value of min element 
data["Variable_A"].argmin()

4

In [21]:
# argmax()-It will return the lowest index value of max element 
data["Variable_A"].argmax()

7

In [23]:
# values
data["Variable_A"].values

array([ 6.,  1.,  8.,  1.,  0.,  5.,  3., 10.,  2.,  8., nan, 10., 10.,
        1.])

In [25]:
# group by
data.groupby("Variable_E").size()

Variable_E
City A    5
City B    3
City C    5
dtype: int64

In [27]:
data.groupby("Variable_E")["Variable_A"].mean()

Variable_E
City A    6.4
City B    4.5
City C    2.8
Name: Variable_A, dtype: float64

In [29]:
data.groupby("Variable_E").mean()

            Variable_A  Variable_B  Variable_C  Variable_D  Variable_Z
Variable_E
City A             6.4  131.200000        73.2   12.800000     45000.0
City B             4.5  127.333333        74.0    7.666667     45000.0
City C             2.8  145.200000        63.2   27.000000     45000.0

In [30]:
data.groupby("Variable_E").agg({"Variable_B":"mean", "Variable_C":"sum"})

            Variable_B  Variable_C
Variable_E
City A      131.200000         366
City B      127.333333         222
City C      145.200000         316

In [31]:
data.groupby("Variable_E")